2023.12.21.(목)

교재 4장 Azure 사용자와 그룹, 액세스 관리

개요 - 테넌트 오른쪽 그림 잘 보기!

테넌트: 최상위 계층

구독과 태넌트는 1:1 구조

---

### ID와 구독

- 팀의 구성원이 로그인하고 권한에 따라 리스를 액세스할 수 있게 해주는 ID와 액세스 관리 서빗
- 구독: 리소스가 존재하는 논리적인 공간

### ID

- 태넌트(tenant)
    - (=기본 디렉터리)
    - 테넌트는 하나 이상의 구독과 연결 가능
- 실습
    - entra ID
    - 테넌트 만들기
    - 특징
        - 내부 설정을 하려면 테넌시를 변경하여 내부를 변경하여야 함

### 구독

- 계정과 연결된 클라우드 리소스의 논리적인 관리 단위이며 비용을 청하기 위해 묶는 단위
- 구독 - 디렉터리 변경을 통해 연결 주체를 바꿀 수 있음

### 사용자와 그룹

- 태넌트에 사용자 계정을 등록하여 액세스 제어가 가능하지만, 사용자 계정만으로 권한을 제어하기 보다는 사용자 그룹을 사용할 권한을 구현
- 사용자 > 새사용자
- 유형
    - 클라우드 ID
        - 엔트라 안에서만 존재
    - 게스트 사용자
        - 외부의 신뢰할 수 있는 다른 공갑ㄷ나 다른 테넌트에서 제공
    - 하이브리드 ID
        - 기업 내 공급자

### 보안그룹

구독이나 리소스, 개별리소스의 액세스 관리 가능

사용자 그룹 할당 방식

- 정적 방식
    - 프리티어는 정적만 가능
- 동적 방식

그룹에 사용자를 넣는 방법

- 그룹 자체에서 할당하는 방법
- 그룹을 만들어 놓고 사용자 설정에서 변경
- 그룹을 만들고 정보에서 사용자를 추가

### 역할 기반 액세스 제어(RBAC)

- 기업에서 클라우드를 ㅅ용할 경우 조직 궝원이 역할에 따라 클라우드 리소스를 액세스 해야하는 기능이 반드시 필요함
- RBAC를 사용하면 리소스로 할 수 있는 작업을 지정할 수 있다.
